zhac-project/zhac-wired-core/sdkconfig.defaults
# SPDX-FileCopyrightText: 2025-2026 Evgenij Cjura and project contributors
# SPDX-License-Identifier: AGPL-3.0-or-later
#
# zhac-wired-core -- TARGET-NEUTRAL defaults.
#
# Anything that depends on the SoC lives in sdkconfig.defaults.<target>, which
# ESP-IDF applies automatically AFTER this file (tools/cmake/kconfig.cmake:182):
#
#   sdkconfig.defaults            <- this file, every target
#   sdkconfig.defaults.esp32p4    <- P4 + C6 SKU
#   sdkconfig.defaults.esp32s31   <- S31-solo SKU (when the toolchain lands)
#
# ⚠ THIS FILE MUST EXIST, even if it were empty. Straight from the IDF docs:
# "If AND ONLY IF an sdkconfig.defaults file exists, the build system will also
# attempt to load defaults from sdkconfig.defaults.TARGET_NAME." Delete it and
# every per-target file silently stops being read -- no warning, no error.
#
# Rule of thumb for where a line goes: if the symbol name contains a chip
# (ESP32P4_*), or its value was chosen for a specific board's silicon, flash or
# clock, it belongs in the per-target file. System behaviour that should be
# identical across SKUs belongs here.
#
# Default target is set here so a fresh `idf.py build` with no set-target
# produces the shipping SKU rather than falling back to esp32.
# `idf.py set-target esp32s31` overrides it.
CONFIG_IDF_TARGET="esp32p4"

# --- Kernel -----------------------------------------------------------------
# 1 ms tick: needed by the per-second cron tick in simple_rules and by
# lwIP / WS server timing.
CONFIG_FREERTOS_HZ=1000

# 10 s ceiling, IDLE0 exempt: the Lua and event-bus loops yield through CPU0
# and a brief stall there during NVS commits is normal.
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n

CONFIG_FREERTOS_ISR_STACKSIZE=4192
# Renamed in IDF v6.0 (was CONFIG_MAIN_TASK_STACK_SIZE; kconfgen still
# auto-replaces the old name, but only with an `info:` line nobody reads).
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4192

# --- Memory -----------------------------------------------------------------
# PSRAM is mandatory in this firmware -- the device pool, the log ring and the
# 6,235-definition tables all assume it. The PLACEMENT knobs (RODATA, external
# BSS, speed, mode) are per-target: which of them exist and what they cost
# differs by SoC, so they live in the per-target files.
CONFIG_SPIRAM=y

# --- Storage ----------------------------------------------------------------
# Both current boards are 16 MB. Flash MODE and FREQUENCY are per-target --
# they are timing choices validated against specific silicon.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- Diagnostics ------------------------------------------------------------
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_BROWNOUT_DET=y
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y
CONFIG_COMPILER_STACK_CHECK_MODE_STRONG=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_USE_TRACE_FACILITY=y

# --- Network ----------------------------------------------------------------
# Socket pool: 3 internal httpd + 9 user WS + 2 REST + 2 MQTT = 16.
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_HTTPD_WS_SUPPORT=y

# Internal EMAC. This is the only Ethernet Kconfig symbol that is real here:
# the RMII/RGMII interface selection and the REF_CLK direction are runtime
# fields of eth_esp32_emac_config_t, set in the per-board eth PHY source.
#
# Earlier drafts also carried CONFIG_ETH_PHY_INTERFACE_RMII and
# CONFIG_ETH_RMII_CLK_INPUT; both are unknown symbols in IDF v6.0 and were
# silently ignored, implying configuration that was not happening. Catch that
# class with:
#   idf.py reconfigure 2>&1 | grep 'unknown kconfig symbol'
#
# That grep does NOT catch the OTHER silent-drop class -- a symbol kconfgen
# knows but cannot select, which it drops to the choice default with no warning
# at all (see the ESP32P4_REV_MIN block in sdkconfig.defaults.esp32p4). Only
# checking the RESOLVED value catches that: tools/check_resolved_config.sh.
CONFIG_ETH_USE_ESP32_EMAC=y

# --- Performance ------------------------------------------------------------
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_MBEDTLS_COMPILER_OPTIMIZATION_PERF=y
CONFIG_LWIP_IRAM_OPTIMIZATION=y
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=11520
CONFIG_LWIP_TCP_WND_DEFAULT=11520
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y

# --- Radio ------------------------------------------------------------------
# No radio in Phase 0. Deliberately absent: CONFIG_ZHAC_NCP_ZNP / _EZSP / _C6.
# Phase 1 adds esp_zigbee_backend behind a Kconfig choice -- UART_RCP on the
# P4 (ot_rcp on the onboard C6), NATIVE on the S31.

# Runtime diagnostics for the Info page (main/sys_diag.cpp).
#
# GENERATE_RUN_TIME_STATS is what makes per-core CPU% possible at all:
# sys_metrics_sample_cpu_pct() deltas the FreeRTOS per-core idle-task run-time
# counters, and with this off it returns a hard 0 for both cores -- which reads
# as a real measurement rather than "unavailable". USE_TRACE_FACILITY backs
# uxTaskGetSystemState(), used to find the smallest stack headroom across every
# live task.
#
# Both cost a small per-task bookkeeping overhead and a timer read per context
# switch. That is the price of being able to answer "what is this gateway
# doing" without a JTAG probe, on a device whose whole job is to run unattended.
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
